<template>
<layout-wrap-main>
    <app-block>
        <app-page-title :title="pageTitle"></app-page-title>
    </app-block>
    <attention-block title="ご注意">
        <app-text-area>
            <ul>
                <li>以下の内容をよくお読みいただき、入場予約システムの、適正・円滑な運用にご協力ください。</li>
                <li>開催に際しては徹底した衛生管理を行いますが、来場により感染しないことを保証するものではありません。</li>
                <li>感染拡大防止策を遵守してください。今後の状況によりやむを得ず、来場を制限・禁止する場合があります。</li>
            </ul>
        </app-text-area>
    </attention-block>
    <app-block-normal>
        <app-box-red>
            <app-text-area>
                <p style="font-size: 1.25rem; line-height: 130%;"><strong>ユーザーの作成・同伴人数についての訂正</strong></p>
                <p><strong>同居家族の方が別々に来場される場合などには、複数のユーザーを作成できます。<br>また、1ユーザーの同伴人数を6人まで可能に変更しました。</strong></p>
                <p>「複数ユーザーの作成を禁止」する旨の表記は、<u>1人の方が複数のユーザーを作成したり、必要以上のチケットを取得したりする行為を禁止</u>する意図のものでございました。</p>
                <p>人数設定の変更は、お問合わせいただくか、追加でユーザーの作成をお願いいたします。</p>
            </app-text-area>
        </app-box-red>
    </app-block-normal>
    <app-heading-block title='入場予約制について'>
        <app-text-area>
            <p>新型コロナウイルス感染拡大防止の観点から、また来場人数を制限し、安全・快適にお楽しみいただける運営を実現するために「入場予約制」を実施します。</p>
            <p>来場を希望される方は、以下の内容をご確認ください。</p>
        </app-text-area>
    </app-heading-block>
    <app-heading-block title='基本事項'>
        <app-detail>
            <dt><app-label-box>対象者</app-label-box></dt>
            <dd>
                <p>在校生徒（75〜77回生）の同居家族<br><strong class="red">在校生の登録・予約は不要です！</strong></p>
            </dd>
            <dt><app-label-box>日程</app-label-box></dt>
            <dd>
                <p>5月13日（金）・5月14日（土）</p>
                <ul class="list-note">
                    <li>本年度は両日とも開放します</li>
                </ul>
            </dd>
            <dt><app-label-box>時間枠</app-label-box></dt>
            <dd>
                <p>9:00〜15:00 を２時間で区分予定。</p>
                <ul class="list-note">
                    <li>各日の来場希望人数に基づいて、4/27以降に発表します</li>
                </ul>
            </dd>
            <dt><app-label-box>時間枠</app-label-box></dt>
            <dd>
                <p>場内は感染拡大防止策に定める制限人数以下に維持します（数値：非公表）</p>
                <ul class="list-note">
                    <li>「入場チケット」は3年生・出演者のご家族を優先した上で、先着順</li>
                </ul>
            </dd>
        </app-detail>
    </app-heading-block>
    <app-heading-block title='来場の手順'>
        <ul class="list-flow">
            <li class="list-flow__item">
                <h3 class="list-flow__title">専用サイトにログイン（4月25日0:00〜5月2日23:59）</h3>
                <p>このページの下部から「専用サイト」にアクセスしてユーザー登録してください。<br>※ドメイン「@ngtfes.com」からのメールを受信できるメールアドレスでご登録ください。</p>
            </li>
            <!--  -->
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">ユーザー区分・来場日・同伴人数を登録（4月25日0:00〜5月2日23:59）</h3>
                <p>ユーザー区分の「認証コード（プリントで配布）」を入力してください。また、来場を希望される日程と、一緒に来場される同伴人数を登録してください。</p>
                <p>日程を検討される場合には「<nuxt-link class="page-link" to="/timetable">ステージタイムテーブル</nuxt-link>」をご参照ください。</p>
            </li>
            <!--  -->
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">入場チケットを取得（〜開催当日まで）</h3>
                <p>登録した来場日の、いずれか１つ時間枠のチケットのみを取得できます。入場チケットは先着順です。各時間枠ごとの最大発券枚数に達し次第、配布を終了します。</p>
                <p><b>配布開始時間</b></p>
                <table class="normal-table">
                    <tbody>
                        <tr><th>優先取得</th><td>5月3日 20:00</td></tr>
                        <tr><th>75回生</th><td>5月4日 20:00</td></tr>
                        <tr><th>76回生</th><td>5月6日 20:00</td></tr>
                        <tr><th>77回生</th><td>5月7日 20:00</td></tr>
                    </tbody>
                </table>
            </li>
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">健康管理フォームに回答（来場日の朝）</h3>
                <p>「専用サイト」内のアクセスできる「健康管理フォーム」に、来場日の朝に回答してください。<br>フォームで確認しますので、<u>来場日の2週間前から、体温計測を含む体調確認を徹底して</u>ください。<br>※回答がない場合や、文化祭スタッフの定める「感染拡大防止基準」に反する方のチケットは利用できません。</p>
            </li>
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">文化祭に来場（来場日）</h3>
                <p>受付で、入場チケットのQRコードを読み取ります。画面に表示してお進みください。入場前には、手指の消毒をお願いします。時間枠ごとのリストバンドを装着いただきます。</p>
            </li>
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">文化祭をお楽しみください</h3>
                <p>校内で自由にお楽しみください。場内ではルールを守り、スタッフの誘導に従ってください。リストバンドは常に、見える位置に装着してください。</p>
            </li>
            <!--  -->
            <li class="list-flow__item">
                <h3 class="list-flow__title">退場</h3>
                <p>チケットの対象時間が終了しましたら、<u>速やかに校内からご退出</u>ください。<br>※不正な滞留を確認した場合にはお声がけします。<br>※時間外に模擬店などは体験いただけません。</p>
            </li>
        </ul>
    </app-heading-block>
    <app-heading-block title="注意事項">
        <p>システムを利用する前に、以下の注意事項を必ずご確認ください。<br>専用サイトにアクセスした時点で、以下の内容を理解・同意したものとみなします。</p>
        <app-box-red>
            <app-text-area>
                <p>ユーザー登録やチケットの取得は、文化祭への入場・模擬店やステージの十分な体験を保証するものではありません。感染状況や当日の混雑などにより変更となる場合があります。</p>
                <p>雨天時には滞在可能な敷地面積が縮小するため、天候状況によっては、直前（前日など）に来場のお断りをご連絡することがあります。</p>
                <!-- <p>取得したチケットは、スクリーンショットを保存してください。システム障害時に利用します。</p> -->
                <!-- <p>当日の混雑状況により、入場をお待ちいただいたり、模擬店・ステージを十分にお楽しみいただけない可能性があります。</p> -->
            </app-text-area>
        </app-box-red>
        <app-text-area>
            <ul>
                <li>取得・登録された情報の取り消しや変更はその理由に関わらず致しかねます。取得・情報登録の際にはその内容を十分にご確認ください。</li>
                <li>ログインID（メールアドレス）やパスワードの紛失、デバイスの充電切れなどによってチケットを表示できない場合は入場できません。</li>
                <li>対象者を限定して配布する専用パスワードやWebサイト情報などを外部に公開したり、対象外の方に譲渡することは禁止します。</li>
                <li>全ての方が平等にお楽しみいただけるよう、また感染者発生時の追跡を確実化するため、入場チケットの譲渡、転売は禁止します。</li>
                <li>必要枚数以上を取得したり、必要以上のユーザーを作成してチケットを取得する行為などを含む、システムの不正な使用やそれを試みることは、これを固く禁止します。これらの行為を確認した場合、当該ユーザーの入場チケットを無効化します。より多くの方にお楽しみいただけるよう、適切な数量の取得にご協力ください。</li>
                <li>場内ではスタッフの指示に従い、ルール・マナーならびに「感染拡大防止策」を遵守してください。他の方のご迷惑となる行為、不適切な行為を確認した場合にはご退場いただきます。円滑な運営にご協力をお願いいたします。</li>
                <li>当日の混雑状況によっては「入場チケット」をお持ちでも、入場までにお時間がかかる場合や、入場をお待ちいただく可能性があります。</li>
                <li>チケットをお持ちで無い時間には入場できません。また、密集を避けるため、チケットの対象時間の終了後には速やかにご退出・ご帰宅ください。</li>
                <li>入場チケットの取得は、模擬店やステージを必ずご体験いただけることを保証するものではありません。ご入場いただいても、混雑状況によっては十分にご体験いただけない場合もございます。また、模擬店などをご体験いただくには、追加の金券購入が必要です。</li>
                <li>来場者用の駐車場はございません。送迎を含む学校付近での路駐は禁止します。公共交通機関をご利用ください。</li>
                <li>サーバーダウン、アクセス増加による通信遅延、天災などの不可抗力を含むシステムの不具合によって、お客様の受けた損害・損失についてはその一切を補償しません。またそれらの不具合を事由として、予告なく運営の中断・中止を行う場合があります。</li>
                <li>お客様の通信状況・デバイスの不調・使用OSなどに起因する、損失・損害については責任を負いません。良好な通信環境でご利用ください。</li>
                <li>入力いただいた情報は、長田高校文化祭スタッフの「プライバシーポリシー」に基づいて適切に取り扱います。公式サイトよりご確認ください。</li>
                <li>感染状況は急激に変動する可能性があるため、やむを得ず直前に内容の変更、開催の延期・中止、来場対象者の変更をすることがあります。これらの変更や追加規則は、「入場チケット」を取得された後でも適用されます。</li>
                <li>開催内容や運営方針を含む全ての情報は、予告なく変更する場合があります。なおそれに伴うチケットの変更や金銭的補償は致しかねます。</li>
            </ul>
        </app-text-area>
    </app-heading-block>
    <app-heading-block title="よくあるご質問">
        <p>お問合せ前に以下の内容をご確認ください。</p>
        <app-faq-accordion :content="faqContent"></app-faq-accordion>
    </app-heading-block>
    <app-heading-block title="専用サイトはこちら">
        <layout-button-center style="padding-top: 1rem;">
            <a class="app-button-box" href="https://ticket.app.ngtfes.com/user/account/login_form.php" target="_blank" rel="noopener noreferrer">専用サイトへアクセス</a>
        </layout-button-center>
    </app-heading-block>
    <app-block>
        <info-box title='お問い合せ'>
            <app-text-area>
                <p>来場予約についてご不明な点がございましたら、以下のメールアドレスへお問い合わせください。</p>
                <ul class="list-note">
                    <li>来場予約に係る運営は長田高校文化祭スタッフが実施しています。本校の事務室ならびに職員室へのお問い合わせはお控えください。</li>
                </ul>
                <p><strong>長田高校文化祭スタッフ 運営企画部 誘導企画パート<br><a class="page-link" href="mailto:contact@ngtfes.com">contact@ngtfes.com</a></strong></p>
            </app-text-area>
        </info-box>
    </app-block>
</layout-wrap-main>
</template>


<script>
export default {
    data(){
        return {
            pageTitle:'入場予約・来場の手順について',
            faqContent: [
                // {
                //     title: 'ログインできません',
                //     texts: ['ユーザー登録を先にお済ませください。パスワードを忘れた場合には、ログインページの下部にあるリンクから再登録できます。','それでもログインできない場合はメールでお問い合わせください。個別に対応させていただきます。'],
                // },
                {
                    title: '当日券はありますか',
                    texts: ['現地での配布はございません。'],
                },
                {
                    title: 'スマートフォンを持っていません',
                    texts: ['PCなどにて予約券を取得してください。取得した予約券の表示画面（QRコード含む）を印刷して持参ください。'],
                },
                {
                    title: '日程について',
                    texts: ['本年度は13日（金）・14日（土）ともに、同居家族の方にご来場いただけます。','ただし、２日目は休日のため混雑が予想されます。１日目のご来場をおすすめします。'],
                },
                {
                    title: '日によって内容は違いますか',
                    texts: ['室内模擬店、食品模擬店、展示などについては両日とも同内容で実施予定です。','ステージの「<a class="page-link" href="/2022/timetable">タイムテーブル</a>」は日によって異なりますので、事前にご確認ください。'],
                },
                {
                    title: 'メールが受信できません',
                    texts: ['「@ezweb.ne.jp」などのキャリアメールで、自動配信メールを受信できないケースが相次いでいます。','ご登録の際は、「@gmail.com」などのWebメールをご利用ください。','それでも受信できない場合には、お問合せください。']
                },
                {
                    title: 'ステージの演目に合ったチケットがありません',
                    texts: ['ステージの演目の「開始〜終了」に合致する時間枠のチケットがない場合には、<b>ステージ上演開始時点で入場できているチケット</b>を取得してください。','上演開始時点で、観覧スペースにいる方は、上演終了後まで滞在可能といたします。','なおその場合、観覧後は速やかにご退出ください。']
                }
            ],
        }
    },
    head(){
        return {
            title:'入場予約について',
        }
    },
}
</script>
