<template>
    <layout-wrap-main>
        <app-page-title title="プライバシーポリシー"></app-page-title>
        <app-heading-block title='長田高校文化祭プライバシーポリシー'>
            <app-text-area>
                <p>長田高校文化祭2022「<nuxt-link class="page-link" to="/">WEAVE</nuxt-link>」公式Webサイト（以下「当サイト」という）をご覧いただきありがとうございます。</p>
                <p>当サイト運営者、長田高校文化祭スタッフ（以下「当チーム」という）は、当サイト運営に関連してユーザーから取得する一切の個人情報について、以下の通りプライバシーポリシー（以下「当ポリシー」という）を定めます。</p>
                <p>ユーザーは当サイトの利用を開始するにあたり以下内容を理解・同意したものとみなします。</p>
            </app-text-area>
        </app-heading-block>
        <app-heading-block title='取得する情報・方法'>
            <p>当サイト運営にあたりユーザーから以下の情報を取得します。ただしユーザーが使用するサービスの内容によってはその全てを取得するとは限りません。</p>
            <app-heading-mini title="当チームからの直接的取得">
                <app-text-area>
                    <p>当サイトはユーザーから当サイト、並びにそれに関連したインターネットメール・公式ソーシャルメディア・情報入力フォームを介して以下の情報を取得することがあります。</p>
                    <ol>
                        <li>氏名</li>
                        <li>生年月日</li>
                        <li>住所・電話番号・メールアドレス、その他連絡先</li>
                        <li>画像・動画・音声・文書その他ユーザーによる生成物</li>
                        <li>アンケート回答などによって取得する情報（例：意見、コメント、フィードバックなど）</li>
                        <li>各種応募によって送信する情報</li>
                        <li>位置情報、統計情報</li>
                        <li>ソーシャルメディア使用状況</li>
                        <li>各種手段においてユーザーから送信・提供されたデータや情報</li>
                        <li>その他、当チームが定める情報</li>
                    </ol>
                </app-text-area>
            </app-heading-mini>
            <app-heading-mini title="第三者による、第三者を経由する取得">
                <app-text-area>
                    <p>ユーザーエクスペリエンス向上のため、各種アナリティクスツール等を当サイトに導入することがあります。</p>
                    <p>それらは当チーム以外の企業その他開発元などによって提供されており、個人情報保護方針は各ツールの定めるものに準拠します。当チームはそれらのツールを経由して取得した情報を必要に応じて使用します。</p>
                    <ul>
                        <li>
                            <h5>Google アナリティクス</h5>
                            <p>当サイトではGoogle アナリティクスを使用しています。このGoogleアナリティクスではトラフィックデータの収集のためにCookieを使用します。トラフィックデータは匿名で収集されており、個人を特定できるものではありません。これはCookieを無効にすることで収集を拒否することが可能です。お使いのブラウザーの設定をご確認ください。</p>
                            <p>これらの取り扱いの詳細については<a class="page-link" href="https://policies.google.com/technologies/partner-sites" target="_blank" rel="noopener noreferrer">こちら（Google公式ページ）</a>よりご確認ください。</p>
                        </li>
                    </ul>
                </app-text-area>
            </app-heading-mini>
        </app-heading-block>
        <app-heading-block title='使用目的'>
            <app-text-area>
                <p>取得した個人情報は以下の目的において使用します。</p>
                <ol>
                    <li>当Webサイトならびに公式ソーシャルメディアにおけるサービス提供のため</li>
                    <li>当イベントならびにそれに関連する企画・運営と、その最適化のため</li>
                    <li>当サイトの運営の改善のため</li>
                    <li>ユーザーとの連絡・質問やご意見への回答のため</li>
                    <li>その他関連する当チームが必要と判断する目的のため</li>
                </ol>
            </app-text-area>
        </app-heading-block>
        <app-heading-block title='個人情報保護'>
            <app-text-area>
                <p>当チームはプライバシーの機密性が全てのユーザー個人の基本的かつ重要な権利であることを理解し、当ポリシーに基づき慎重に運営してまいります。</p>
                <p>取得した全ての個人情報は適切かつ合理的な方法で管理、保管し、事前の告知と該当ユーザーの同意なく先に定めた目的外に利用したり、第三者に提供することはありません。</p>
                <p>ただし以下の場合を除きます。</p>
                <ol>
                    <li>法令、条例その他関係当局の要請等に基づき開示する場合</li>
                    <li>生命、身体、財産の保護のために必要であるが、本人の同意を得ることが困難な場合</li>
                    <li>その他法令の定める場合</li>
                </ol>
                <p>なお、現代の技術環境下において絶対的な安全性・機密性を保証することは困難であることをご理解ください。</p>
            </app-text-area>
        </app-heading-block>
        <app-heading-block title='期間'>
            <app-text-area>
                <p>当チームは先に示した目的を達するために必要な期間において個人情報を保持します。ただしこの期間において継続的に保持する義務があるわけではありません。</p>
                <p>上記期間終了後は、適切かつ合理的な方法で当該データを破棄します。</p>
            </app-text-area>
        </app-heading-block>
        <app-heading-block title='当ポリシーの変更'>
            <app-text-area>
                <p>当チームは個人情報の保護や運営を最適化すること、その他当チームが定める基準により、必要に応じて当ポリシーを変更・修正できます。</p>
                <p>大幅な変更を行う場合や法令上必要と判断される場合は、当サイト上で変更に関しての情報を明示し、その他適切な手段で該当ユーザーにその旨を通知します。</p>
                <p>当ポリシーの最終更新日時は当ページ下部に記載しています。全てのユーザーは当サイトにアクセスする度に、最新のプライバシーポリシーに同意されることとなります。必ずご確認ください。</p>
            </app-text-area>
        </app-heading-block>
        <app-heading-block title='開示、訂正、利用停止、削除'>
            <app-text-area>
                <p>ユーザーから自己の個人情報の開示、訂正、削除、利用停止の請求を受けた場合には遅延なく以下の通り対応します。</p>
                <ol>
                    <li>法令への違反となる場合、ユーザー・当チームまたは第三者に対し重大な権利利益を害する恐れのある場合などをのぞいて開示します。</li>
                    <li>ユーザーは、当チームの取り扱う本人の情報に対して、誤りがある場合等に訂正・削除の請求が可能です。<br>請求を受けた場合当チームは必要と判断すれば遅延なく該当情報の訂正削除を行います。訂正削除の実施有無に関わらずその旨を通知します。</li>
                    <li>利用目的の範囲を超えての使用、または不正な手段で取得された情報であることを理由に、ユーザー本人から利用の停止または消去を請求された場合、遅滞なく必要な調査を行い、必要な対応を行い、その旨を通知します。</li>
                </ol>
            </app-text-area>
        </app-heading-block>
        <app-box-contact tgt="promotion" msg="個人情報の取り扱いに関するお問い合わせは、文化祭スタッフへお寄せください。"></app-box-contact>
        <app-block>
            <layout-row>
                <p>最終更新：2022年3月20日（日本時間）<br>&copy;2022 Nagata School Festival All rights reserved.</p>
            </layout-row>
        </app-block>
    </layout-wrap-main>
</template>

<script>
export default {
    data(){
        return {
        }
    },
    head() {
        return {
            title: 'プライバシーポリシー',
            meta: [
                { hid: 'description', name: 'description', content: '長田高校文化祭2022「WEAVE」のプライバシーポリシーです。当サイトのご利用前に必ずご確認ください。' },
            ]
        }
    },
}
</script>

<style lang="scss" scoped>
</style>
